app/controllers/articulos_controller.rb

SELECT "articulos".* FROM "articulos"
---
  def index
    @articulos = Articulo.all

INSERT INTO "articulos" ("titulo", "contenido", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["titulo", "TITULO!!!!!!!!1"], ["contenido", "papaya lo mejorsito9"], ["user_id", 1], ["created_at", "2018-08-13 23:51:21.477185"], ["updated_at", "2018-08-13 23:51:21.477185"]]
---
  def create
    @articulo = Articulo.new(articulo_params)
    @articulo.user_id = current_user.id

    if @articulo.save

SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_articulo
      @articulo = Articulo.find(params[:id])